resources/help/data-protection.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-06-04 Tue 15:25 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Data Protection</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="CSE" />
</head>
<body>
<div id="content">
<h1 class="title">Data Protection</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5d802df">1. Principle</a></li>
<li><a href="#org4704196">2. User data</a></li>
<li><a href="#org1c046fa">3. Data security</a></li>
<li><a href="#org1149266">4. Acquiring your data</a></li>
<li><a href="#org33efd16">5. Removing your data</a></li>
</ul>
</div>
</div>
<p>
This document enumerates all the ways in which we (as in, the THERMOS project consortium) may use data entered into a THERMOS installation.
</p>

<p>
If you don't like this, you can run your own copy of THERMOS, in which case you will be in charge of your data.
</p>

<div id="outline-container-org5d802df" class="outline-2">
<h2 id="org5d802df"><span class="section-number-2">1</span> Principle</h2>
<div class="outline-text-2" id="text-1">
<p>
THERMOS is currently a research project without an active goal of commercial exploitation.
The source code for the system will be published and permissively licensed, with the explicit goal of delivering whatever value the system can to the wider society.
</p>

<p>
To let you look at THERMOS without having to install it yourself, we are providing a copy running on this server.
You are allowed to use this copy of the application subject to the understanding that:
</p>

<ol class="org-ol">
<li>There is no guarantee of service.
<ul class="org-ul">
<li>The application may disappear at any time. 
However, we will provide you with your own data so long as we still have access to it ourselves.</li>
<li>The program's outputs may be nonsense</li>
<li>The system's reliability is arbitrary</li>
</ul></li>
<li>You are using a shared and limited resource, so please don't be silly</li>
</ol>
</div>
</div>

<div id="outline-container-org4704196" class="outline-2">
<h2 id="org4704196"><span class="section-number-2">2</span> User data</h2>
<div class="outline-text-2" id="text-2">
<p>
THERMOS does not store very much user data; the system's user accounts are there to help you keep your data private.
We are not interested in spying on you or building business leads.
</p>

<p>
The information you can enter about yourself is:
</p>

<ol class="org-ol">
<li>An email address</li>
<li>Your name</li>
</ol>

<p>
However, you need not use an email address and need not give us your name.
</p>

<p>
If you do give us your email address, we may send you emails for the purpose of:
</p>

<ol class="org-ol">
<li>Telling you about changes to the service</li>
<li>Contacting you to ask you your use of the service, for the purposes of assessing the impact and value of the project.</li>
</ol>

<p>
A session cookie will be stored on your computer when you login. 
These are a technical detail required to remember that you are logged in, and are explicitly allowed without confirmation under the EU legislation about cookies.
</p>

<p>
We also record about your user account:
</p>

<ul class="org-ul">
<li>When you login and out of the system</li>
<li>How many projects, maps, and network models you have run</li>
<li>Summary statistics about these data, specficially
<ul class="org-ul">
<li>How many participants are collaborating on projects</li>
<li>How large the maps and networks you create are</li>
<li><p>
The geographic location of your maps and networks.
</p>

<p>
We will not otherwise process or look at your uploaded GIS files, except insofar as needed to provide the services you request.
</p></li>
</ul></li>
<li>Diagnostic information about errors or faults in the system</li>
<li>Which other accounts you have worked with; this information is only used for access control.
We are not interested in building a picture of your social network, and will not look at this stuff.</li>
</ul>
</div>
</div>

<div id="outline-container-org1c046fa" class="outline-2">
<h2 id="org1c046fa"><span class="section-number-2">3</span> Data security</h2>
<div class="outline-text-2" id="text-3">
<p>
All data in THERMOS is stored in a physical server on site at CSE.
We keep this server updated and secured to the best of our ability. 
Server access is restricted to those employees who manage the system.
</p>

<p>
If you extend project access to someone else, they will be able to see all the data in that project.
</p>

<p>
All communications to the server are encrypted; data is not encrypted at rest within the machine, so an attacker who gained privileged access to the server could view all data anyone has uploaded.
</p>
</div>
</div>

<div id="outline-container-org1149266" class="outline-2">
<h2 id="org1149266"><span class="section-number-2">4</span> Acquiring your data</h2>
<div class="outline-text-2" id="text-4">
<p>
At the moment you can download your network diagrams and maps via the user interface.
If you want to get hold of any other bits of data contact us and we can work something out.
We have no interest in holding onto your data so we can wring money out of you, and indeed are not that interested in the data itself.
</p>
</div>
</div>

<div id="outline-container-org33efd16" class="outline-2">
<h2 id="org33efd16"><span class="section-number-2">5</span> Removing your data</h2>
<div class="outline-text-2" id="text-5">
<p>
At the moment there is no button to delete your user account, but we can delete it for you if you drop us a line.
Later we will probably put in a button to do this, the only reason we haven't is that we're busy people.
You can delete projects, maps, and networks. When you do this, they are genuinely deleted in an unrecoverable way.
</p>
</div>
</div>
</div>
</body>
</html>
